import React, { useState } from "react";
import Head from "next/head";
import { Row, Col, List } from "antd";
import { FormOutlined } from "@ant-design/icons";

import Header from "../components/Header";
import Author from "../components/Author";

const mylist = [
  {
    title: "vivo50看实力",
    context:
      "芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，",
  },
  {
    title: "vivo50看实力",
    context:
      "芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，",
  },
  {
    title: "vivo50看实力",
    context:
      "芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，",
  },
  {
    title: "vivo50看实力",
    context:
      "芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，",
  },
  {
    title: "vivo50看实力",
    context:
      "芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，",
  },
  {
    title: "vivo50看实力",
    context:
      "芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，",
  },
  {
    title: "vivo50看实力",
    context:
      "芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，芜湖起飞，",
  },
];

const Lists = () => (
  <div>
    <List
      header={<div>最新</div>}
      itemLayout="vertical"
      dataSource={mylist}
      renderItem={(item) => (
        <List.Item>
          <div className="list-title">{item.title}</div>
          <div className="list-icon">
            <span>
              <FormOutlined />
              {new Date().toLocaleDateString()}
            </span>
            <span>
              <FormOutlined />
              类别
            </span>
            <span>
              <FormOutlined />
              观看次数
            </span>
          </div>
          <div className="list-context">{item.context}</div>
        </List.Item>
      )}
    />
  </div>
);
export default Lists;
